#!/usr/bin/env python
# coding: utf-8

# # 通付盾风险决策系统在五年后的使用场景和替代可能
# ## 2019级信用管理专业 41904408 洪心悦 

# 近几年，随着我国科学技术水平的飞速进步，大数据在生活生产中的应用越来越多，这极大地提高了厂家、消费者获取信息的效率，也满足了人们生活和生产的多方面需求。然而这种技术虽然带给了人们许多的便利，也带来了诸多的信息安全隐患。现在，消费者的个人数据和支付数据在交给电商企业之后，大部分都被存储在一个中心化数据库之中，而这个中心化数据库会遭到许多恶意攻击，用户的个人信息并不安全。五年后，大数据将会加速渗透到我们的日常生活中，从衣食住行各个层面均有体现。由于技术发展，未来的信息获取会更加容易，用户信息数据泄露现象也可能变得更加普遍，更多的不法分子会盗取信息进行非法活动，国民信息安全问题也许会比现在更加严峻。
# 

# 针对这一点，我认为通付盾风险决策系统可能在未来结合区块链这一金融科技技术，对互联网环境中各种场景下的设备、用户等进行可信度判断，构建一种全方位、全覆盖的金融科技应用与服务信用体系。例如，五年后，当用户需要在某一平台上进行重要交易时，可以利用区块链技术，发挥其分布式存储、去中心化、可追溯、不可篡改的优势，将区块链技术与通付盾的身份识别系统（以设备指纹技术和HUE多分子身份验证为基础的身份识别应用）相结合，使得用户的数据控制权能够牢牢把握在自己手中，不需要依赖第三方，从而从根本上避免了用户的个人隐私信息通过第三方平台、系统或者应用泄露。如果通付盾能够充分利用区块链地优势，未来电商企业也许就无需再去存储众多用户的个人信息和支付数据等。使用区块链加密个人数据，不但能够满足用户数据隐私安全地保护，还能够去除如今繁琐的身份认证、审核环节，极大地缩短交易时间成本，提升用户的使用体验。商家将不再需要向消费者索要任何数据，消费者将不必再担心个人数据安全，信息安全管理者也不再需要为保护海量数据而绞尽脑汁。
# 

# 当然，如果通付盾在五年后未能实现技术的革新，仍然只是基于设备指纹之类的技术进行客户特征的分析，帮助区分客户群体，可能就会出现难以满足消费者、电商平台需求的情况。因此，它也许会被能够利用区块链有针对性地制定营销策略，提高营销效率或是当时能够使用新兴的金融科技技术来全方位防范信息泄露的系统以及应用取代。
